# DB-Setup

We need to split the data into multiple data frames, one per table, to do that we also need to normalize the data to create the sql.

In [1]:
import pandas as pd

In [2]:
dateparse = lambda x: pd.datetime.strptime(x, '%d/%m/%Y')

original_df = pd.read_csv('./datasets/clean_snacks.csv', dtype={ 'client_id': str }, parse_dates=['date'], date_parser=dateparse)
snacks_df = original_df.copy()
snacks_df.head()

,office,warehouse,category,brand,product_id,flavor,client,point_of_sale,distributor,date,units,devolution_units,sale_amount,sale_discount,sale_devolution,incentive
0,Cali,Tulua,Producto De Extrusion,Cheetos,53407164,Tradicional,NaN,NaN,Tiendas,2014-04-01,324,0,181530.0,32675.40,-0.0,True
1,Nariño,Popayan,Producto De Extrusion,Cheetos,53407164,Tradicional,NaN,NaN,Tiendas,2014-04-01,36,0,20170.0,4437.40,-0.0,True
2,Nariño,Popayan,Producto De Extrusion,Cheetos,53102174,Tradicional,NaN,NaN,Tiendas,2014-04-01,73200,0,91227.0,20069.98,-0.0,False
3,Cali,Sur,Producto De Extrusion,Cheetos,53408215,Tradicional,NaN,NaN,Tiendas,2014-04-01,1080,0,605100.0,108918.43,-0.0,True
4,Cali,Norte,Producto De Extrusion,Cheetos,53408024,Tradicional,NaN,NaN,Superficies Menores,2014-04-01,100,40,73280.0,10992.00,29312.0,True

## Locations
I want to separate a table called locations, this table is going to hold the information for officce and warehouse in conjunction, this is in order to simplify and reuse some data.

In [3]:
location_series = snacks_df['office'].append(snacks_df['warehouse']).drop_duplicates()

locations_df = pd.DataFrame({ 'name': location_series, 'id': range(len(location_series)) }).reset_index(drop=True)
# The locations_df is going to be the locations table
locations_df.head()

        name  id
0       Cali   0
1     Nariño   1
2  Medellina   2
3    Pereira   3
4  Medellinb   4

In [4]:
# merge with the snacks_df to create the id of the join
snacks_df = (
    pd.merge(snacks_df, locations_df, left_on='office', right_on='name')
        .drop(['office', 'name'], axis=1)
        .rename(columns={ 'id': 'office_id' })
)

snacks_df.head(1)

,warehouse,category,brand,product_id,flavor,client,point_of_sale,distributor,date,units,devolution_units,sale_amount,sale_discount,sale_devolution,incentive,office_id
0,Tulua,Producto De Extrusion,Cheetos,53407164,Tradicional,NaN,NaN,Tiendas,2014-04-01,324,0,181530.0,32675.4,-0.0,True,0

In [5]:
# doing the same operation but with the warehouse
snacks_df = (
    pd.merge(snacks_df, locations_df, left_on='warehouse', right_on='name')
        .drop(['warehouse', 'name'], axis=1)
        .rename(columns={ 'id': 'warehouse_id' })
)

snacks_df.head(1)

,category,brand,product_id,flavor,client,point_of_sale,distributor,date,units,devolution_units,sale_amount,sale_discount,sale_devolution,incentive,office_id,warehouse_id
0,Producto De Extrusion,Cheetos,53407164,Tradicional,NaN,NaN,Tiendas,2014-04-01,324,0,181530.0,32675.4,-0.0,True,0,6

## Distributors

I want to build another table called distributor.

In [6]:
distributor_series = snacks_df['distributor'].drop_duplicates().reset_index(drop=True)

distributors_df = pd.DataFrame({ 'id': range(len(distributor_series)), 'name': distributor_series })
distributors_df.head()

   id                 name
0   0              Tiendas
1   1  Superficies Menores
2   2  Grandes Superficies
3   3         Negocios Esp
4   4       Venta En Calle

In [7]:
snacks_df = (
    pd.merge(snacks_df, distributors_df, left_on='distributor', right_on='name')
        .drop(['distributor', 'name'], axis=1)
        .rename(columns={ 'id': 'distributor_id' })
)

snacks_df.head(1)

,category,brand,product_id,flavor,client,point_of_sale,date,units,devolution_units,sale_amount,sale_discount,sale_devolution,incentive,office_id,warehouse_id,distributor_id
0,Producto De Extrusion,Cheetos,53407164,Tradicional,NaN,NaN,2014-04-01,324,0,181530.0,32675.4,-0.0,True,0,6,0

## Points of sale and clients

In [8]:
clients_series = snacks_df['client'].drop_duplicates().dropna().reset_index(drop=True)

clients_df = pd.DataFrame({ 'id': range(len(clients_series)), 'name': clients_series })
clients_df.head()

   id                                     name
0   0                     Almacenes La 14 S.A.
1   1  Supertiendas Y Droguerias Olimpica S.A.
2   2                     Almacenes Exito S.A.
3   3                   Cencosud Colombia S.A.
4   4               Makro Supermayorista S.A.S

In [9]:
points_of_sale_series = snacks_df['point_of_sale'].drop_duplicates().dropna().reset_index(drop=True)

points_of_sale_df = pd.DataFrame({ 'id': range(len(points_of_sale_series)), 'name': points_of_sale_series })
points_of_sale_df.head()

   id                               name
0   0  Tp24 Almacenes La 14 S.A. - Tulua
1   1                        554 - Tulua
2   2                   577 - La Campiña
3   3                587 - Tulua Canasta
4   4                       560 - Zarzal

In [10]:
aux_df = (
    pd.merge(snacks_df, clients_df, left_on='client', right_on='name')
        .drop(['name'], axis=1)
        .rename(columns={ 'id': 'client_id' })
)

In [11]:
aux_df = (
    pd.merge(aux_df, points_of_sale_df, left_on='point_of_sale', right_on='name')
        .drop(['name', 'client', 'point_of_sale'], axis=1)
        .rename(columns={ 'id': 'point_of_sale_id' })
)

aux_df.head(1)

,category,brand,product_id,flavor,date,units,devolution_units,sale_amount,sale_discount,sale_devolution,incentive,office_id,warehouse_id,distributor_id,client_id,point_of_sale_id
0,Producto De Extrusion,Cheetos,53407164,Tradicional,2014-04-01,36,0,21888.0,3283.2,-0.0,True,0,6,2,0,0

In [12]:
points_of_sale_df = (
    pd.merge(points_of_sale_df, aux_df[['client_id', 'point_of_sale_id']], left_on='id', right_on='point_of_sale_id')
        .drop(['point_of_sale_id'], axis=1)
        .groupby('id')['client_id', 'name']
        .aggregate(lambda x: x[0])
        .reset_index()
)

points_of_sale_df.head(1)

   id  client_id                               name
0   0          0  Tp24 Almacenes La 14 S.A. - Tulua

Now drop the unneccessary columns in the snacks_df

In [13]:
snacks_df = (
    pd.merge(snacks_df, points_of_sale_df, left_on='point_of_sale', right_on='name', how='left')
        .drop(['point_of_sale', 'client', 'name', 'client_id'], axis=1)
        .rename(columns={ 'id': 'point_of_sale_id' })
)

snacks_df.head(1)

,category,brand,product_id,flavor,date,units,devolution_units,sale_amount,sale_discount,sale_devolution,incentive,office_id,warehouse_id,distributor_id,point_of_sale_id
0,Producto De Extrusion,Cheetos,53407164,Tradicional,2014-04-01,324,0,181530.0,32675.4,-0.0,True,0,6,0,NaN

## Products

I want to separate the products in a table.

In [14]:
products_df = (
    snacks_df[['product_id', 'brand', 'category']]
        .groupby('product_id')['brand', 'category']
        .aggregate(lambda x: x.head(1))
        .reset_index()
        .rename(columns={ 'product_id': 'id' })
)

products_df.head()

         id          brand              category
0  53100002  Ruffles Econo  Producto En Frituras
1  53100003  Ruffles Econo  Producto En Frituras
2  53100004  Ruffles Econo  Producto En Frituras
3  53100007  Ruffles Econo  Producto En Frituras
4  53100008            M12  Producto En Frituras

In [15]:
snacks_df = snacks_df.drop(columns=['category', 'brand'])

snacks_df.head(1)

,product_id,flavor,date,units,devolution_units,sale_amount,sale_discount,sale_devolution,incentive,office_id,warehouse_id,distributor_id,point_of_sale_id
0,53407164,Tradicional,2014-04-01,324,0,181530.0,32675.4,-0.0,True,0,6,0,NaN

## Flavor

Separation of the flavor table

In [16]:
flavors_series = snacks_df['flavor'].drop_duplicates().dropna().reset_index(drop=True)

flavors_df = pd.DataFrame({ 'id': range(len(flavors_series)), 'name': flavors_series })
flavors_df.head()

   id          name
0   0   Tradicional
1   1        Chilli
2   2         Queso
3   3  Caramelizado
4   4         Pollo

In [17]:
snacks_df = (
    pd.merge(snacks_df, flavors_df, left_on='flavor', right_on='name')
        .drop(['flavor', 'name'], axis=1)
        .rename(columns={ 'id': 'flavor_id' })
)

In [18]:
snacks_df.head()

,product_id,date,units,devolution_units,sale_amount,sale_discount,sale_devolution,incentive,office_id,warehouse_id,distributor_id,point_of_sale_id,flavor_id
0,53407164,2014-04-01,324,0,181530.0,32675.40,-0.0,True,0,6,0,NaN,0
1,53102174,2014-04-01,5760,0,71784.0,10767.80,-0.0,False,0,6,0,NaN,0
2,53102174,2014-04-01,12960,0,161516.0,24227.54,-0.0,False,0,6,0,NaN,0
3,53407164,2014-04-01,180,0,100850.0,15127.50,-0.0,True,0,6,0,NaN,0
4,53407164,2014-04-01,26208,0,146793.0,24954.77,-0.0,True,0,6,0,NaN,0

These are going to be the tables to create:

* flavors => flavors_df
* products => products_df
* clients => clients_df
* points_of_sale => points_of_sale_df
* distributors => distributors_df
* locations => locations_df
* sales => snacks_df

In [19]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://group7:12345678@final-project.cdlzun12f0nc.us-east-2.rds.amazonaws.com:5432/final-project')

In [20]:
tables = {
    'flavors': flavors_df,
    'products': products_df,
    'clients': clients_df,
    'points_of_sale': points_of_sale_df,
    'distributors': distributors_df,
    'locations': locations_df,
    'sales': snacks_df
}

for table, df in tables.items():
    df.to_csv(f'final-datasets/{table}.csv', index=False, chunksize=50000)